const allPapers = {
    "paper1": {
        "title": "Crop Farming 1 Sinhala",
        "questions": [
            { "q": "1. මෑන්ඩරින් දොඩම්වල රෝගී හෝ දුර්වල පැල කළ යුත්තේ කුමක්ද?", "options": ["ඉවත් කිරීම", "එලෙසම තැබීම", "පොහොර යෙදීම"], "img": "" },
            { "q": "2. ප්‍රභාසංශ්ලේෂණයට අවශ්‍ය සාධක මොනවාද?", "options": ["හිරු එළිය, කාබන්ඩයොක්සයිඩ්, ජලය සහ හරිතප්‍රභ", "නයිට්‍රජන්, පස්, ජලය", "කාබන්ඩයොක්සයිඩ් පමණක්"], "img": "" },
            { "q": "3. පසෙහි ආම්ලිකතා මීටර අගය 5.6 නම් එහි ස්වභාවය කුමක්ද?", "options": ["ආම්ලික වේ", "ක්ෂාරීය වේ", "උදාසීන වේ"], "img": "" },
            { "q": "4. පසෙහි ලවණ සාන්ද්‍රණය මනින ඒකකය කුමක්ද?", "options": ["EC (විද්‍යුත් සන්නායකතාව)", "pH අගය", "මීටර් අගය"], "img": "" },
            { "q": "5. Venlo වර්ගයේ වහලය සඳහා අදාළ රූපය කුමක්ද?", "options": ["c", "b", "a"], "img": "p1_5.webp" },
            { "q": "6. සෙල අඩුවී (Cell Tray) නිවැරදිව පැල සිටුවන ආකාරය දැක්වෙන රූපය කුමක්ද?", "options": ["a", "b", "c"], "img": "p1_6.webp" },
            { "q": "7. පලිබෝධ නාශක ඉසීමේදී ආරක්ෂාව සඳහා භාවිතා කළ යුත්තේ කුමක්ද?", "options": ["ආරක්ෂිත ඇඳුම් කට්ටල", "සාමාන්‍ය ඇඳුම්", "අත් ආවරණ පමණක්"], "img": "" },
            { "q": "8. අඛණ්ඩ භෝග වගාවේ සශ්‍රීකත්වය පවත්වා ගැනීමට ඇති ක්‍රමය කුමක්ද?", "options": ["එකම භූමියේ මාරුවෙන් මාරුවට භෝග වගා කිරීම", "එකම භෝගය නිතර වගා කිරීම", "ඉඩම වගා නොකර තැබීම"], "img": "" },
            { "q": "9. Rapseed යනු කුමක්ද?", "options": ["තෙල් ලබා ගන්නා ශාක වර්ගයක්", "රසායනික පොහොරක්", "කෘමි නාශකයක්"], "img": "" },
            { "q": "10. 10-00-02-08 පොහොර මිශ්‍රණයේ පොටෑසියම් අගය කීයද?", "options": ["02", "10", "08"], "img": "" },
            { "q": "11. භෝග අස්වැන්න නෙළීමට පෙර ශාකයක මුදුන් දල්ල කපා ඉවත් කරන්නේ ඇයි?", "options": ["අතුල වර්ධනය පාලනය කිරීමට හෝ උත්තේජනය කිරීමට", "පැලය මැරීමට", "ජලය අඩුවෙන් ලබා දීමට"], "img": "" },
            { "q": "12. බෝග ආරක්‍ෂා කිරීම සඳහා යොදන දැල් වර්ගය හඳුනාගැනීමට අදාළ රූපය කුමක්ද?", "options": ["a", "b", "c"], "img": "p1_12.webp" },
            { "q": "13. පාංශු උෂ්ණත්වය ඉහළ නැංවීමට වඩාත් සුදුසු පටලය කුමක්ද?", "options": ["විනිවිද පෙනෙන පටලය", "කළු පටලය", "ඝන ප්ලාස්ටික් පටලය"], "img": "" },
            { "q": "14. බණ්ඩක්කා කරල් එළියට පැමිණි දින සිට අස්වනු නෙළන කාලය දින කීයද?", "options": ["දින 30 සිට 60 දක්වා", "දින 10 සිට 20 දක්වා", "දින 70 සිට 90 දක්වා"], "img": "" },
            { "q": "15. WSC (Whole Sugar Crop) යනු කුමක්ද?", "options": ["සහල් පැල සම්පූර්ණයෙන්ම ඉදිමට පෙර අස්වනු නෙළා සාදන ලද ආහාර", "වියළි සහල්", "පැරණි බඩඉරිඟු"], "img": "" },
            { "q": "16. බ්‍රැසිකේසි (Brassicaceae) පවුලට අයත් එළවළු වර්ගයක් නම් කරන්න?", "options": ["ගෝවා", "වට්ටක්කා", "කැරට්"], "img": "" },
            { "q": "17. මුල් එළවළුවක් ලෙස සැලකිය හැක්කේ කුමක්ද?", "options": ["කැරට්", "ගෝවා", "ගම්මිරිස්"], "img": "" },
            { "q": "18. හයිඩ්‍රොපොනික් (Hydroponic) වගාව යනු කුමක්ද?", "options": ["ජලය මත පදනම් වූ වගා ක්‍රමයකි", "පස් මත වගා කිරීම", "ගස් මත වගා කිරීම"], "img": "" },
            { "q": "19. පන්දලම් ක්‍රමය භාවිතයෙන් වගා කරන පලතුරු වර්ගයක් කුමක්ද?", "options": ["මිදි", "පැපොල්", "කෙසෙල්"], "img": "" },
            { "q": "20. අස්වනු නෙළා ඉදිමට පෙර ගබඩා කර තබා ගන්නේ කුමක් සඳහාද?", "options": ["පැගිරි පලතුරු පශ්චාත් අස්වනු පාලනයට", "ඉක්මනින් විකිණීමට", "පැසීමට"], "img": "" }
        ]
    },
    "paper2": {
        "title": "Crop Farming 2 Sinhala",
        "questions": [
            { 
                "q": "1. බතල", 
                "options": ["ප්‍රධාන වශයෙන් පිෂ්ටය අඩංගු ආහාරයකි", "ප්‍රධාන වශයෙන් ප්‍රෝටීන් අඩංගු ආහාරයකි","ප්‍රධාන වශයෙන් ලිපිඩ අඩංගු ආහාරයකි"], 
                "img": "" 
            }
        ]
    }
};
